<?php


return [
    // Common
    'page_not_found' => 'الصفحة غير موجودة.',
    'record_not_found' => 'السجل غير موجود.',
    'method_not_allowed' => 'طريقة الطلب غير مسموحة.',
    'validation_failed' => 'فشل التحقق من البيانات.',
    'unauthorized_access' => 'غير مصرح لك بالدخول.',
    'access_forbidden' => 'الوصول مرفوض.',
    'access_denied' => 'تم رفض الوصول.',
    'rate_limit_exceeded' => 'عدد كبير من الطلبات، يرجى المحاولة لاحقاً.',
    'database_error' => 'حدث خطأ في قاعدة البيانات.',
    'unexpected_error' => 'حدث خطأ غير متوقع، يرجى المحاولة لاحقاً.',
    'success' => 'تمت العملية بنجاح.',


    // OTP
    'otp.not_found' => 'OTP غير موجود.',
    'otp.expired' => 'OTP انتهت.',
    'otp.invalid' => 'OTP غير صحيح.',
    'otp.sent' => 'OTP تم ارساله بنجاح.',
    'otp.verified' => 'تم التحقق من OTP بنجاح.',

    // Auth
    'auth' => [
        'register' => 'تم التسجيل بنجاح.',
        'login' => 'تم تسجيل الدخول بنجاح.',
        'logout' => 'تم تسجيل الخروج بنجاح.',
        'password_reset' => 'تم تغيير كلمة المرور بنجاح.',
    ],

    // Working Day
    'working_day.created' => 'تم إنشاء يوم العمل بنجاح.',
    'working_day.updated' => 'تم تحديث يوم العمل بنجاح.',
    'working_day.index' => 'تم استرجاع أيام العمل بنجاح.',

    'store' => [
        'discount_banner_percentage' => 'خصومات تصل حتى :discount%🔥',
        'discount_banner_fixed' => 'خصومات بقيمة :amount🔥',
    ],

    'store_available_for_delivery' => 'المتجر متاح للتوصيل.',
    'store_cannot_deliver_to_address' => 'المتجر لا يمكنه التوصيل إلى هذا العنوان.',
    'store_is_closed' => 'المتجر مغلق حالياً.',
    'some_products_unavailable' => 'بعض المنتجات في السلة غير متاحة.',
];
